{
  "quest1_event": {
    "animation": "ruined_settlement",
    "title": "A Harsh Reality",
    "flavour_text": "Amidst the rubble, you can see subtle movement in the distance. As soon as you step further in to investigate though, you hear a screeching noise pierce through the air. \n\nGlowing red eyes and velvety wings emerge from the shadows, as the screeches multiply and the tension rises. Not being sure how to deal with this fateful encounter, you duck behind a rock, narrowly avoiding the demonic mess of limbs and sharp smiling fangs. \n\nThis horrifying, mutated creature is caked in blood, but it's smaller than you... With a loud shriek, it starts to back away from you, realizing you might be trouble. It's not until the creature departs that you realize why it was bloodied to begin with.\n\nYou happen upon the mangled remains of a small child, not even enough to bury. All you can find nearby is an old doll, stained with the same blood.\n\nSometimes, reality is harsh.\n\n",
    "item_updates": {
      "quest_item2": 1
    }
  },
  "quest2_event": {
    "animation": "ruined_settlement",
    "title": "Best Laid Plans",
    "flavour_text": "Following a series of rumours, you were able to more or less pinpoint the location of the people sent by the citadel. You would have to be careful here-- any wrong move could get you killed or worse. You don't have long to think about the danger, so much as it finds you. There is a small plume of smoke erupting from behind a large rock, and you decide to take a peek. There's a camp, with eight armed and dangerous looking soldiers surrounding a campfire.\n\nThis is bad. If they spot you, you're done for. However, this is a pretty good position you find yourself in, as they all seem fairly distracted by a heated argument about whether some dress is blue or yellow or something. Seizing the opportunity, you crawl up to the largest tent, sneaking your arm underneath the tarp to see if there's anything worth taking with you.\n\nWhat's this? A backpack? You don't need another one of those, you ponder, before retreating away safely to check the contents. There are lots of supplies in here, very likely stolen... And a rolled up piece of paper. It's a map of scout patrol routes! This is going to be a huge help in tackling the problem.\n\nFather Cannoli was right. Things can be solved without violence.\n\n",
    "item_updates": {
      "quest_item3": 1
    }
  },
  "quest3_event": {
    "animation": "ruined_settlement",
    "title": "The Definition of Cursed",
    "flavour_text": "Following DA DOG's tip, you travel to the ravine he mentioned, wondering just how 'cursed' this laptop can really be. It's a computer. Technology isn't cursed, it's a helpful tool! You've made very good use of it yourself, restoring those facilities and making the world a better place. Looking down, it's too dark to see the bottom, but luckily you always carry a length of rope on you. With a few strong knots and some elbow grease, you make your slow descent into the chasm. Your only company is the wind whistling through the cliffs.\n\nAfter a good minute of climbing down, you reach the bottom and begin to look for the dreaded laptop, often pausing to wonder if this isn't just some joke. Not a lot of sane people would take jobs from a PUSSYLAND inhabitant. Thinking the thought out loud makes you chuckle, at the very least.\n\nYour idle musings are cut short by a low beep. The kind a laptop would make. There's no way.\n\nFrantically searching, you find your prize soon after. A battered skeleton, not fresh but not ancient by any means. It's a dead guy. He's cradling a surprisingly intact laptop, which you rightfully assume is what you came for. How is it even still working?\n\nYou carefully pry the device from the dead guy's hands, and open the lid. Immediately, you recoil in disgust and close it back down. What you found wasn't pornography, that would have been a mercy.\n\nInstead, what you found was the vilest computer code you have ever seen. The words 'else if' are seared into your retinas ad nauseam.\n\nThere is no reward in the world good enough.\n\n",
    "item_updates": {
      "quest_item4": 1
    }
  }
}